blog/chaoxing-statistics.org
#+TITLE:       超星是如何统计学习情况的
#+AUTHOR:      shirui
#+EMAIL:       1229408499@qq.com
#+DATE:        2021-01-06 三
#+URI:         /blog/%y/%m/%d/chaoxing-statistics
#+KEYWORDS:    超星
#+TAGS:        超星
#+LANGUAGE:    zh
#+OPTIONS:     H:3 num:nil toc:nil \n:t ::t |:t ^:nil -:nil f:t *:t <:t
#+DESCRIPTION: 讲讲我对超星统计学习情况的理解

* 前言
写这篇文章当然是因为最近我有一门网课需要刷平时分，这门课的视频个数又不多，还多个视频合在一个网页上，最后又要求我们有几百次的学习次数，然后还要求我们有2个小时的阅读时长，但读物加起来顶多只有一两百页，超星的阅读统计又有些问题。为了给后人避坑，我就把摸索出来的一些经验分享出来。

如果你的网课只需要看视频的话就不用往下看了，网上对于这种方法的解决方案有很多，简单的就是在手机上自己刷。

代码的使用方法不给出，请自行钻研，直接在控制台使用是不行的，需要在页面打开时就注入代码，实现这个功能的插件网上有很详细的教程。

* 章节学习次数
** 统计方法
每打开一个视频页面等上一小会，学习次数就会增加，尚不知不滚动会不会有不良影响
** 刷分方法
只需要对一个页面不停刷新即可
** 代码实现
#+begin_src js
// 我对于大部分操作加入了随机数
// 避免可能的后台检测
// 一定时间后刷新本网页
setTimeout(() => location.reload(), 1000 * Math.random() * 20);
let now = 0;
// 这是滚动当前页面，也是避免不良影响
setInterval(() => window.scroll(0, (now = now + Math.random() * 10)), 50);
#+end_src
* 阅读
** 统计方法
经过测试，在网页上滚动具体阅读资料的区域刷分效果不好，我测试时第二天只增加了几分钟的阅读时长，所以只能滚动全局的页面
在刷分时我还注意到一个问题，单个页面可能有分值上限，所以我又改进了刷分方式
** 刷分方法
打开阅读界面，不停向下滚动到底，到底后随机打开一个阅读页面，继续上续操作
** 代码实现
#+begin_src js
// 获取随机阅读页面
function randu() {
  let arr = [];
  document
    .querySelectorAll(".mt10 .mb15 a")
    .forEach((dom) => arr.push(dom.href));
  return arr[Math.floor(Math.random() * arr.length)];
}
// 向下滚动直到底
let now = 0;
setInterval(() => {
  window.scroll(0, (now += Math.random()));
  if (now - 1 > window.scrollY)
    setTimeout(() => (location.href = randu()), 1000 * Math.random());
}, 40);
#+end_src
