old/chaoxing-statistics.html
<!DOCTYPE html>
<html lang="zh">
<head>
<!-- 2021-12-09 四 17:18 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>超星是如何统计学习情况的</title>
<meta name="author" content="shirui" />
<meta name="description" content="讲讲我对超星统计学习情况的理解" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/static/style.css" type="text/css"/>
            <link rel="stylesheet" href="/static/org.css" type="text/css"/>
            <meta http-equiv="content-type" content="application/xhtml+xml; charset=UTF-8" />
            <meta name="viewport" content="initial-scale=1,width=device-width,minimum-scale=1">
</head>
<body>
<div id="preamble" class="status">
<div class="header">
            <a href="https://lampze.github.io">lampze's Blog</a>
            <span id="post-date" style="float: right">2021-01-06 三 00:00</span>
            </div>
</div>
<div id="content" class="content">
<header>
<h1 class="title">超星是如何统计学习情况的</h1>
</header>
<div id="outline-container-orgfac1750" class="outline-2">
<h2 id="orgfac1750">前言</h2>
<div class="outline-text-2" id="text-orgfac1750">
<p>
写这篇文章当然是因为最近我有一门网课需要刷平时分，这门课的视频个数又不多，还多个视频合在一个网页上，最后又要求我们有几百次的学习次数，然后还要求我们有2个小时的阅读时长，但读物加起来顶多只有一两百页，超星的阅读统计又有些问题。为了给后人避坑，我就把摸索出来的一些经验分享出来。<br>
</p>

<p>
如果你的网课只需要看视频的话就不用往下看了，网上对于这种方法的解决方案有很多，简单的就是在手机上自己刷。<br>
</p>

<p>
代码的使用方法不给出，请自行钻研，直接在控制台使用是不行的，需要在页面打开时就注入代码，实现这个功能的插件网上有很详细的教程。<br>
</p>
</div>
</div>

<div id="outline-container-orgcae4b80" class="outline-2">
<h2 id="orgcae4b80">章节学习次数</h2>
<div class="outline-text-2" id="text-orgcae4b80">
</div>
<div id="outline-container-org541ef86" class="outline-3">
<h3 id="org541ef86">统计方法</h3>
<div class="outline-text-3" id="text-org541ef86">
<p>
每打开一个视频页面等上一小会，学习次数就会增加，尚不知不滚动会不会有不良影响<br>
</p>
</div>
</div>
<div id="outline-container-orgf91f52a" class="outline-3">
<h3 id="orgf91f52a">刷分方法</h3>
<div class="outline-text-3" id="text-orgf91f52a">
<p>
只需要对一个页面不停刷新即可<br>
</p>
</div>
</div>
<div id="outline-container-orge203fb4" class="outline-3">
<h3 id="orge203fb4">代码实现</h3>
<div class="outline-text-3" id="text-orge203fb4">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #556b2f;">// </span><span style="color: #556b2f;">&#25105;&#23545;&#20110;&#22823;&#37096;&#20998;&#25805;&#20316;&#21152;&#20837;&#20102;&#38543;&#26426;&#25968;</span>
<span style="color: #556b2f;">// </span><span style="color: #556b2f;">&#36991;&#20813;&#21487;&#33021;&#30340;&#21518;&#21488;&#26816;&#27979;</span>
<span style="color: #556b2f;">// </span><span style="color: #556b2f;">&#19968;&#23450;&#26102;&#38388;&#21518;&#21047;&#26032;&#26412;&#32593;&#39029;</span>
setTimeout(() =&gt; location.reload(), <span style="color: #8a3b3c; font-weight: bold;">1000</span> * Math.random() * <span style="color: #8a3b3c; font-weight: bold;">20</span>);
<span style="font-weight: bold;">let</span> <span style="color: #383a42;">now</span> = <span style="color: #8a3b3c; font-weight: bold;">0</span>;
<span style="color: #556b2f;">// </span><span style="color: #556b2f;">&#36825;&#26159;&#28378;&#21160;&#24403;&#21069;&#39029;&#38754;&#65292;&#20063;&#26159;&#36991;&#20813;&#19981;&#33391;&#24433;&#21709;</span>
setInterval(() =&gt; window.scroll(<span style="color: #8a3b3c; font-weight: bold;">0</span>, (now = now + Math.random() * <span style="color: #8a3b3c; font-weight: bold;">10</span>)), <span style="color: #8a3b3c; font-weight: bold;">50</span>);
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgb1dbe02" class="outline-2">
<h2 id="orgb1dbe02">阅读</h2>
<div class="outline-text-2" id="text-orgb1dbe02">
</div>
<div id="outline-container-org6d62d17" class="outline-3">
<h3 id="org6d62d17">统计方法</h3>
<div class="outline-text-3" id="text-org6d62d17">
<p>
经过测试，在网页上滚动具体阅读资料的区域刷分效果不好，我测试时第二天只增加了几分钟的阅读时长，所以只能滚动全局的页面<br>
在刷分时我还注意到一个问题，单个页面可能有分值上限，所以我又改进了刷分方式<br>
</p>
</div>
</div>
<div id="outline-container-org2ab04d2" class="outline-3">
<h3 id="org2ab04d2">刷分方法</h3>
<div class="outline-text-3" id="text-org2ab04d2">
<p>
打开阅读界面，不停向下滚动到底，到底后随机打开一个阅读页面，继续上续操作<br>
</p>
</div>
</div>
<div id="outline-container-org45f8d72" class="outline-3">
<h3 id="org45f8d72">代码实现</h3>
<div class="outline-text-3" id="text-org45f8d72">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #556b2f;">// </span><span style="color: #556b2f;">&#33719;&#21462;&#38543;&#26426;&#38405;&#35835;&#39029;&#38754;</span>
<span style="font-weight: bold;">function</span> <span style="font-weight: bold;">randu</span>() {
  <span style="font-weight: bold;">let</span> <span style="color: #383a42;">arr</span> = [];
  document
    .querySelectorAll(<span style="color: #8a3b3c;">".mt10 .mb15 a"</span>)
    .forEach((dom) =&gt; arr.push(dom.href));
  <span style="font-weight: bold;">return</span> arr[Math.floor(Math.random() * arr.length)];
}
<span style="color: #556b2f;">// </span><span style="color: #556b2f;">&#21521;&#19979;&#28378;&#21160;&#30452;&#21040;&#24213;</span>
<span style="font-weight: bold;">let</span> <span style="color: #383a42;">now</span> = <span style="color: #8a3b3c; font-weight: bold;">0</span>;
setInterval(() =&gt; {
  window.scroll(<span style="color: #8a3b3c; font-weight: bold;">0</span>, (now += Math.random()));
  <span style="font-weight: bold;">if</span> (now - <span style="color: #8a3b3c; font-weight: bold;">1</span> &gt; window.scrollY)
    setTimeout(() =&gt; (location.href = randu()), <span style="color: #8a3b3c; font-weight: bold;">1000</span> * Math.random());
}, <span style="color: #8a3b3c; font-weight: bold;">40</span>);
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<script type="text/javascript" src="/static/main.js"></script>
            <center id="modi-date">2021-12-09 四 17:18</center>
</div>
</body>
</html>
